# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Utils
brew 'fzf'
brew 'git'
brew 'gh'
brew 'tree'
brew 'gd'
brew 'gnupg'
brew 'tmux'
brew 'tmuxinator'
brew 'telnet'
brew 'httpie'
brew 'pinentry-mac'
brew 'pdftk-java'
brew 'pure'

# Programming
brew 'nvm'
brew 'node'
brew 'yarn'
brew 'lua'
brew 'meilisearch'
brew 'minio/stable/minio'
brew 'mas'

# PHP
brew 'composer'
brew 'imagemagick'

# Development
cask 'herd'
cask 'dbngin'
cask 'warp'
cask 'ngrok'
cask 'postman'
cask 'tableplus'
cask 'gifox'
cask 'helo'
cask 'tinkerwell'

# Editors
cask 'jetbrains-toolbox'
cask 'sublime-text'
cask 'visual-studio-code'

# Apps
cask 'obs'
cask 'screenflow'
cask 'raycast'
cask 'slack'
cask 'discord'
